app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "body" = ?, "updated_at" = ?, "status" = ? WHERE "articles"."id" = ?  [["title", "Prodotto_5"], ["body", "ewq1vbfteRRR1"], ["updated_at", "2023-06-21 15:47:52.422348"], ["status", "archived"], ["id", 12]]
---
  def update
    @article = Article.find(params[:id])

    if @article.update(article_params)